OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j93.h
extern __at(0x0F6D) __sfr LCDDATA7;

typedef union
  {
  struct
    {
    unsigned S8C1               : 1;
    unsigned S9C1               : 1;
    unsigned S10C1              : 1;
    unsigned S11C1              : 1;
    unsigned S12C1              : 1;
    unsigned S13C1              : 1;
    unsigned S14C1              : 1;
    unsigned S15C1              : 1;
    };

  struct
    {
    unsigned SEG8COM1           : 1;
    unsigned SEG9COM1           : 1;
    unsigned SEG10COM1          : 1;
    unsigned SEG11COM1          : 1;
    unsigned SEG12COM1          : 1;
    unsigned SEG13COM1          : 1;
    unsigned SEG14COM1          : 1;
    unsigned SEG15COM1          : 1;
    };

  struct
    {
    unsigned S08C1              : 1;
    unsigned S09C1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __LCDDATA7bits_t;

extern __at(0x0F6D) volatile __LCDDATA7bits_t LCDDATA7bits;

#define _S8C1                   0x01
#define _SEG8COM1               0x01
#define _S08C1                  0x01
#define _S9C1                   0x02
#define _SEG9COM1               0x02
#define _S09C1                  0x02
#define _S10C1                  0x04
#define _SEG10COM1              0x04
#define _S11C1                  0x08
#define _SEG11COM1              0x08
#define _S12C1                  0x10
#define _SEG12COM1              0x10
#define _S13C1                  0x20
#define _SEG13COM1              0x20
#define _S14C1                  0x40
#define _SEG14COM1              0x40
#define _S15C1                  0x80
#define _SEG15COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA8 Bits

extern __at(0x0F6E) __sfr LCDDATA8;

typedef union
  {
  struct
    {
    unsigned S16C1              : 1;
    unsigned S17C1              : 1;
    unsigned S18C1              : 1;
    unsigned S19C1              : 1;
    unsigned S20C1              : 1;
    unsigned S21C1              : 1;
    unsigned S22C1              : 1;
    unsigned S23C1              : 1;
    };

  struct
    {
    unsigned SEG16COM1          : 1;
    unsigned SEG17COM1          : 1;
    unsigned SEG18COM1          : 1;
    unsigned SEG19COM1          : 1;
    unsigned SEG20COM1          : 1;
    unsigned SEG21COM1          : 1;
    unsigned SEG22COM1          : 1;
    unsigned SEG23COM1          : 1;
    };
  } __LCDDATA8bits_t;

extern __at(0x0F6E) volatile __LCDDATA8bits_t LCDDATA8bits;

#define _S16C1                  0x01
#define _SEG16COM1              0x01
#define _S17C1                  0x02
#define _SEG17COM1              0x02
#define _S18C1                  0x04
#define _SEG18COM1              0x04
#define _S19C1                  0x08
#define _SEG19COM1              0x08
#define _S20C1                  0x10
#define _SEG20COM1              0x10
#define _S21C1                  0x20
#define _SEG21COM1              0x20
#define _S22C1                  0x40
#define _SEG22COM1              0x40
#define _S23C1                  0x80
#define _SEG23COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA9 Bits

extern __at(0x0F6F) __sfr LCDDATA9;

typedef union
  {
  struct
    {
    unsigned S24C1              : 1;
    unsigned S25C1              : 1;
    unsigned S26C1              : 1;
    unsigned S27C1              : 1;
    unsigned S28C1              : 1;
    unsigned S29C1              : 1;
    unsigned S30C1              : 1;
    unsigned S31C1              : 1;
    };

  struct
    {
    unsigned SEG24COM1          : 1;
    unsigned SEG25COM1          : 1;
    unsigned SEG26COM1          : 1;
    unsigned SEG27COM1          : 1;
    unsigned SEG28COM1          : 1;
    unsigned SEG29COM1          : 1;
    unsigned SEG30COM1          : 1;
    unsigned SEG31COM1          : 1;
    };
  } __LCDDATA9bits_t;

extern __at(0x0F6F) volatile __LCDDATA9bits_t LCDDATA9bits;

#define _S24C1                  0x01
#define _SEG24COM1              0x01
#define _S25C1                  0x02
#define _SEG25COM1              0x02
#define _S26C1                  0x04
#define _SEG26COM1              0x04
#define _S27C1                  0x08
#define _SEG27COM1              0x08
#define _S28C1                  0x10
#define _SEG28COM1              0x10
#define _S29C1                  0x20
#define _SEG29COM1              0x20
#define _S30C1                  0x40
#define _SEG30COM1              0x40
#define _S31C1                  0x80
#define _SEG31COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA10 Bits

extern __at(0x0F70) __sfr LCDDATA10;

typedef union
  {
  struct
    {
    unsigned S32C1              : 1;
    unsigned S33C1              : 1;
    unsigned S34C1              : 1;
    unsigned S35C1              : 1;
    unsigned S36C1              : 1;
    unsigned S37C1              : 1;
    unsigned S38C1              : 1;
    unsigned S39C1              : 1;
    };

  struct
    {
    unsigned SEG32COM1          : 1;
    unsigned SEG33COM1          : 1;
    unsigned SEG34COM1          : 1;
    unsigned SEG35COM1          : 1;
    unsigned SEG36COM1          : 1;
    unsigned SEG37COM1          : 1;
    unsigned SEG38COM1          : 1;
    unsigned SEG39COM1          : 1;
    };
  } __LCDDATA10bits_t;

extern __at(0x0F70) volatile __LCDDATA10bits_t LCDDATA10bits;

#define _S32C1                  0x01
#define _SEG32COM1              0x01
#define _S33C1                  0x02
#define _SEG33COM1              0x02
#define _S34C1                  0x04
#define _SEG34COM1              0x04
#define _S35C1                  0x08
#define _SEG35COM1              0x08
#define _S36C1                  0x10
#define _SEG36COM1              0x10
#define _S37C1                  0x20
#define _SEG37COM1              0x20
#define _S38C1                  0x40
#define _SEG38COM1              0x40
#define _S39C1                  0x80
#define _SEG39COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA11 Bits

extern __at(0x0F71) __sfr LCDDATA11;

typedef union
  {
  struct
    {
    unsigned S40C1              : 1;
    unsigned S41C1              : 1;
    unsigned S42C1              : 1;
    unsigned S43C1              : 1;
    unsigned S44C1              : 1;
    unsigned S45C1              : 1;
    unsigned S46C1              : 1;
    unsigned S47C1              : 1;
    };

  struct
    {
    unsigned SEG40COM1          : 1;
    unsigned SEG41COM1          : 1;
    unsigned SEG42COM1          : 1;
    unsigned SEG43COM1          : 1;
    unsigned SEG44COM1          : 1;
    unsigned SEG45COM1          : 1;
    unsigned SEG46COM1          : 1;
    unsigned SEG47COM1          : 1;
    };
  } __LCDDATA11bits_t;

extern __at(0x0F71) volatile __LCDDATA11bits_t LCDDATA11bits;

#define _S40C1                  0x01
#define _SEG40COM1              0x01
#define _S41C1                  0x02
#define _SEG41COM1              0x02
#define _S42C1                  0x04
#define _SEG42COM1              0x04
#define _S43C1                  0x08
#define _SEG43COM1              0x08
#define _S44C1                  0x10
#define _SEG44COM1              0x10
#define _S45C1                  0x20
#define _SEG45COM1              0x20
#define _S46C1                  0x40
#define _SEG46COM1              0x40
#define _S47C1                  0x80
#define _SEG47COM1              0x80

//==============================================================================


//==============================================================================
//        LCDDATA12 Bits

